garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12F1571.PIC
        <edc:JoinedSFRDef edc:cname="PWM3DC" edc:desc="" edc:name="PWM3DC" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB3">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3DCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3DCL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB3">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCL2" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCL3" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCL4" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCL5" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCL6" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCL7" edc:desc="" edc:mask="0x1" edc:name="PWM3DCL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3DCL" edc:desc="" edc:mask="0xff" edc:name="PWM3DCL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0xff" edc:name="DC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM3DCH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3DCH" edc:desc="" edc:mask="0xff" edc:name="PWM3DCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PWM3PR" edc:desc="" edc:name="PWM3PR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB5">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3PRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3PRL0" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRL1" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRL2" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRL3" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRL4" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRL5" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRL6" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRL7" edc:desc="" edc:mask="0x1" edc:name="PWM3PRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3PRL" edc:desc="" edc:mask="0xff" edc:name="PWM3PRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM3PRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM3PRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB6">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xff" edc:name="PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM3PRH0" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRH1" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRH2" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRH3" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRH4" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRH5" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRH6" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM3PRH7" edc:desc="" edc:mask="0x1" edc:name="PWM3PRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM3PRH" edc:desc="" edc:mask="0xff" edc:name="PWM3PRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
